docs/ReaderPractice.html
<!DOCTYPE html>
<html>
<head>
<!-- 2016-10-06 Thu 21:07 -->
<meta  charset="utf-8">
<meta  name="viewport" content="width=device-width, initial-scale=1">
<title>Reader Practice</title>
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Eric Bailey">
<meta  name="keywords" content="haskell, learning, haskell programming">
<link rel="stylesheet" type="text/css" href="css/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Reader Practice</h1>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">ReaderPractice.hs</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
<a href="https://github.com/yurrriq/haskell-programming/blob/master/src/ReaderPractice.hs">Source</a>
</p>

<p>
First, we include some metadata for <a href="https://www.haskell.org/haddock/">Haddock</a>.
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #75715E;">{-|</span>
<span style="color: #75715E;">Module      : ReaderPractice</span>
<span style="color: #75715E;">Copyright   : (c) Eric Bailey, 2016</span>
<span style="color: #75715E;">License     : MIT</span>

<span style="color: #75715E;">Maintainer  : Eric Bailey</span>
<span style="color: #75715E;">Stability   : experimental</span>
<span style="color: #75715E;">Portability : portable</span>

<span style="color: #75715E;">Chapter 22: Reader Practice</span>
<span style="color: #75715E;">-}</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #F92672;">module</span> <span style="color: #66D9EF;">ReaderPractice</span> <span style="color: #F92672;">where</span>

<span style="color: #F92672;">import</span> <span style="color: #66D9EF;">Control.Applicative</span>
<span style="color: #F92672;">import</span> <span style="color: #66D9EF;">Data.Maybe</span>

<span style="color: #A6E22E;">x, y, z</span> <span style="color: #FD971F;">::</span> [<span style="color: #66D9EF;">Integer</span>]
<span style="color: #A6E22E;">x</span> <span style="color: #FD971F;">=</span> [1, 2, 3]
<span style="color: #A6E22E;">y</span> <span style="color: #FD971F;">=</span> [4, 5, 6]
<span style="color: #A6E22E;">z</span> <span style="color: #FD971F;">=</span> [7, 8, 9]
</pre>
</div>

<p>
Zip <code>x</code> and <code>y</code> using <code>3</code> as the <code>lookup</code> key.
</p>
<div class="org-src-container">

<pre class="src src-haskell" id="orgsrcblock1"><span style="color: #A6E22E;">xs</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>
</pre>
</div>

<p>
Zip <code>y</code> and <code>z</code> using <code>6</code> as the <code>lookup</code> key.
</p>
<div class="org-src-container">

<pre class="src src-haskell" id="orgsrcblock2"><span style="color: #A6E22E;">ys</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>
</pre>
</div>

<p>
Zip <code>x</code> and <code>y</code> using <code>4</code> as the <code>lookup</code> key.
</p>
<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">zs</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">zs</span> <span style="color: #FD971F;">=</span> lookup 4 <span style="color: #FD971F;">$</span> zip x y
</pre>
</div>

<p>
Now zip <code>x</code> and <code>z</code> using a variable <code>lookup</code> key.
</p>
<div class="org-src-container">

<pre class="src src-haskell" id="orgsrcblock3"><span style="color: #A6E22E;">z'</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell" id="orgsrcblock4"><span style="color: #A6E22E;">x1</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> (<span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">Integer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell" id="orgsrcblock5"><span style="color: #A6E22E;">x2</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> (<span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">Integer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell" id="orgsrcblock6"><span style="color: #A6E22E;">x3</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">-&gt;</span> (<span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">xs</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">xs</span> <span style="color: #FD971F;">=</span> lookup 3 <span style="color: #FD971F;">$</span> zip x y
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">ys</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">ys</span> <span style="color: #FD971F;">=</span> lookup 6 <span style="color: #FD971F;">$</span> zip y z
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">z'</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>
<span style="color: #A6E22E;">z'</span> n <span style="color: #FD971F;">=</span> lookup n <span style="color: #FD971F;">$</span> zip x z
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">x1</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> (<span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">Integer</span>)
<span style="color: #A6E22E;">x1</span> <span style="color: #FD971F;">=</span> liftA2 <span style="color: #66D9EF;">(,)</span> xs ys
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">x2</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Maybe</span> (<span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">Integer</span>)
<span style="color: #A6E22E;">x2</span> <span style="color: #FD971F;">=</span> liftA2 <span style="color: #66D9EF;">(,)</span> ys zs
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">x3</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">-&gt;</span> (<span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>, <span style="color: #66D9EF;">Maybe</span> <span style="color: #66D9EF;">Integer</span>)
<span style="color: #A6E22E;">x3</span> n <span style="color: #FD971F;">=</span> (z' n, z' n)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">summed</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Num</span> c <span style="color: #FD971F;">=&gt;</span> (c, c) <span style="color: #FD971F;">-&gt;</span> c
<span style="color: #A6E22E;">summed</span> <span style="color: #FD971F;">=</span> uncurry (<span style="color: #FD971F;">+</span>)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">bolt</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integer</span> <span style="color: #FD971F;">-&gt;</span> <span style="color: #66D9EF;">Bool</span>
<span style="color: #A6E22E;">bolt</span> <span style="color: #FD971F;">=</span> liftA2 (<span style="color: #FD971F;">&amp;&amp;</span>) (<span style="color: #FD971F;">&gt;</span>3) (<span style="color: #FD971F;">&lt;</span>8)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">main</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">IO</span> <span style="color: #66D9EF;">()</span>
<span style="color: #A6E22E;">main</span> <span style="color: #FD971F;">=</span> <span style="color: #F92672;">do</span>
  print <span style="color: #FD971F;">$</span> sequenceA [<span style="color: #66D9EF;">Just</span> 3, <span style="color: #66D9EF;">Just</span> 2, <span style="color: #66D9EF;">Just</span> 1]
  print <span style="color: #FD971F;">$</span> sequenceA [x, y]
  print <span style="color: #FD971F;">$</span> sequenceA [xs, ys]
  <span style="color: #F92672;">let</span> s' <span style="color: #FD971F;">=</span> summed <span style="color: #FD971F;">&lt;$&gt;</span> (<span style="color: #66D9EF;">(,)</span> <span style="color: #FD971F;">&lt;$&gt;</span> xs <span style="color: #FD971F;">&lt;*&gt;</span> ys)
  print <span style="color: #FD971F;">$</span> s'
  print <span style="color: #FD971F;">$</span> fmap summed (<span style="color: #66D9EF;">(,)</span> <span style="color: #FD971F;">&lt;$&gt;</span> xs <span style="color: #FD971F;">&lt;*&gt;</span> zs)
  print <span style="color: #FD971F;">$</span> bolt 7
  print <span style="color: #FD971F;">$</span> fmap bolt z
  print <span style="color: #FD971F;">$</span> sequenceA [(<span style="color: #FD971F;">&gt;</span>3), (<span style="color: #FD971F;">&lt;</span>8), even] 7
  print <span style="color: #FD971F;">$</span> foldr1 (<span style="color: #FD971F;">&amp;&amp;</span>) (sequA 4)
  print <span style="color: #FD971F;">$</span> sequA (fromMaybe 0 s')
  print <span style="color: #FD971F;">$</span> bolt (fromMaybe 0 ys)
</pre>
</div>

<div class="org-src-container">

<pre class="src src-haskell"><span style="color: #A6E22E;">sequA</span> <span style="color: #FD971F;">::</span> <span style="color: #66D9EF;">Integral</span> a <span style="color: #FD971F;">=&gt;</span> a <span style="color: #FD971F;">-&gt;</span> [<span style="color: #66D9EF;">Bool</span>]
<span style="color: #A6E22E;">sequA</span> <span style="color: #FD971F;">=</span> sequenceA [(<span style="color: #FD971F;">&gt;</span>3), (<span style="color: #FD971F;">&lt;</span>8), even]
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Generated by <span class="author">Eric Bailey</span> on <span class="date">2016-10-06 Thu 21:07</span> using <span class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 8.3.6)</span>.
</div>
</body>
</html>